Repository: rhenter/django-api-client
Catalog: docs_src/source/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: Django API Client Documentation
pt_br: Documentação do Django API Client

source: The Django API Client is an API response wrapper, which allows you to iterate through the API as if they were using a local model / object in your project. Whether through the direct customer in an FBV or using personalized CBV (class-based displays), this framework tries to make this communication as easy as possible
pt_br: O Django API Client é um wrapper de resposta da API, que permite iterar com a API como se eles estivesse usando um modelo/objeto local em seu projeto. Seja por meio do cliente direto em uma FBV ou usando CBV personalizada (exibições baseadas em classe), este framework tenta facilitar ao máximo esta comunicação

source: Some reasons to use the **Django API Client**
pt_br: Alguns motivos para se usar o **Django API Client**

source: If you work with microservices with APIs in multiple locations and want to continue using Django as a WebApp with the same capabilities to render data as if you were using native models
pt_br: Se você trabalha com microsserviços com APIs em vários locais e deseja continuar usando o Django como um WebApp com os mesmos recursos para renderizar os dados como se estivesse usando os modelos nativos

source: You want to separate your Django project to let one of them only with the API with DRF and the other as a WebApp with Templates (HTML), CSS, JS instead of using some JS frontend (ReactJS, AngularJS, etc.)
pt_br: Você quer separar o seu projeto Django para deixar um deles somente com a API com DRF e outro como um WebApp com Templates(HTML), CSS, JS ao invés de usar algum frontend JS (ReactJS, AngularJS, etc)

source: You want to use a third party API to list, create and change using the django template system
pt_br: Você deseja usar uma API de terceiros para listar, criar e alterar usando o sistema de templates do django

source: User Guide
pt_br: Guia do Usuário

source: Example
pt_br: Exemplo

source: Add this settings in your project ``settings.py`` file to access your API
pt_br: Adicione esta configuração no seu projeto no arquivo ``settings.py`` para acessar a sua API

source: The details of the configuration will be better explained in the documentation
pt_br: Os detalhes da configuração serão melhor explicados na documentação*

source: Create a clients.py file in the core folder of your project, if you haven't, created it within your project folder to be simple to be imported from anywhere in the project with the following content:
pt_br: Crie um arquivo clients.py em alguma pasta nucleo do seu projeto, caso não tenha, crie dentro da sua pasta do projeto para ficar mais simples de ser importado de qualquer lugar do projeto com o seguinte conteúdo:

source: The name of this variable will be the name of the customer that you will import into every project
pt_br: O nome dessa variável será o nome do cliente que será importado para cada projeto

source: In our case, we have 2 options,"production" and "localhost", the factory generates a `api client` according to the name used and the parameters identified in it
pt_br: É recomendável que o nome venha de uma constante no arquivo settings.py, e se possível ser até uma variável de ambiente

source: Now we are going to list the data using the Django template system default
pt_br: Agora vamos listar os dados usando o sistema padrão do Django

source: Let's imagine which client is located in a folder called clients on project folder (folder containing the settings.py file)
pt_br: Vamos imaginar que o cliente esta em uma pasta dentro da pasta do projeto (pasta que contém o arquivo settings.py)

source: The client will generate a user-friendly structure for each endpoint. Example with the endpoint */order/orders/*:
pt_br: O cliente irá gerar uma estrutura amigavel para cada endpoing. Exemplo com o endpoint */order/orders/*:

source: In your template you can use the forms and pagination snippets. E.g:
pt_br: No seu template você pode usar os snippets de formulários e de paginação. Ex:

source: Example using Bootstrap Styles(CSS)
pt_br: Exemplo usando estilos (CSS) do Bootstrap

source: includes/form_search.html: Form with search input. This ``include`` support placeholder too.
pt_br: includes/form_search.html: Formulário com input de busca. Este ``include`` suporta placeholder tambem.

source: includes/form_paginate_by.html: Select form to choose how many elements the page will be paginate. Ex: by (20, 40, 60, etc ...)
pt_br: includes/form_paginate_by.html: Formulario de Select para escolher com quantos elementos a pagina será paginadaEx: por (20, 40, 60, etc ...)

source: includes/list_paginator.html: Block with pagination elements with the number of pages buttons, previous and next
pt_br: includes/list_paginator.html: Bloco com os elementos de paginação com os butões de número de paginas, anterior e proximo

source: What does that mean?
pt_br: O que isso quer dizer?

source: That the API Client will always generate the structure according to the names of their endpoints
pt_br: Que o API Cliente sempre gerará a estutura de acordo os nomes dos seus endpoints

source: Development
pt_br: Desenvolvimento
