Repository: rhenter/django-api-client
Catalog: docs_src/source/locale/*/LC_MESSAGES/views/cbv.po
Languages: pt_br

source: Using Class Based Views (CBV)
pt_br: Usando Views Baseadas em Classes (CBV)

source: Following the same example as Model ListView, the results returned from the model will go to the context variable ``object_list``, unless you want to customize it. Using ClientAPIListView we will use the attribute ``client_method`` instead of ``model`` to get our results
pt_br: Seguindo o mesmo exemplo do Model ListView, os resultados retornados do modelo irão para a variável de contexto ``object_list``, a menos que você queira personalizá-lo. Usando ClientAPIListView, usaremos o atributo ``client_method`` ao vez do atributo ``model`` padrão para obter nossos resultados

source: template_name: path with name of you template
pt_br: template_name: caminho com nome do template

source: client_method: method of the client that get a list of records of a resource list
pt_br: client_method: método do cliente que list os registros de um resource

source: page_title: Generates a context variable to use in your template
pt_br: page_title: Gera uma variável de contexto para usar no seu template

source: page_base_url: Information used in pagination and the search
pt_br: page_base_url: Informação usada na paginação e na busca

source: paginate_by: Number of items to generate the pagination
pt_br: paginate_by: Némero de itens para gerar a paginação

source: The usage example assumes that the endpoint is ``/order/orders/``
pt_br: O exemplo de uso assume the o endpoint é ``/order/orders/``

source: API Filters
pt_br: Filtros da API

source: Enable filter:
pt_br: Habilitar filtro:

source: To enable a filter for the API you just need to add the filter you want in `api_filters`
pt_br: Para habilitar um filtro para a API você só precisa adiciona o filtro que você deseja em `api_filters`

source: The usage example use the `user`, so if you pass the user on the querystring, this value will be passed to the API
pt_br: O exemplo de uso usa o `user`, então se você passar ao usuário a querystring, este valor será passado para a API

source: Add a custom filter or queryset:
pt_br: Adicionar um filtro ou 'queryset' customizado:

source: To customize a search or call to the API you need to use `get_api_params` adding the parameters you want. Example:
pt_br: Para customizar uma busca ou chamada para a API você precisa usar o `get_api_params` adicionando os parametros que você deseja. Exemplo:

source: The usage example take all params you already have and add the custom `status` to send to the API
pt_br: O exemplo de uso pega todos os parâmetros que você já tem e adiciona o `status` personalizado para enviar para a API

source: Following the same example as Model DetailView, the results returned from the model will go to the context variable ``object``, unless you want to customize it. Using ClientAPIDetailView we will use the attribute ``client_method`` instead of ``model`` to get our result
pt_br: Seguindo o mesmo exemplo do Model DetailView, os resultados retornados do modelo irão para a variável de contexto ``object``, a menos que você queira personalizá-lo. Usando ClientAPIDetailView, usaremos o atributo `` client_method`` em vez de ``model`` para obter nosso resultado

source: client_method: method of the client that to get a record in the resource
pt_br: client_method: método do cliente que pega um registro de um resource

source: Following the same example as Model CreateView, on submit will validate and save, using ClientAPIListView we will use the attribute `` client_method`` instead of ``model`` to get our result
pt_br: Seguindo o mesmo exemplo que o Model CreateView, ao enviar validar e salvar, usando ClientAPIListView, usaremos o atributo ``client_method`` em vez de ``model`` para obter nosso resultado

source: client_method: method of the client that create a record in the resource
pt_br: client_method: método do cliente que criar um registro em um resource

source: Simple
pt_br: Simples

source: Advanced with a custom initial
pt_br: Avançado com dados iniciais customizados

source: client_method: method of the client that to update
pt_br: client_method: método do cliente que atualiza um registro de um resource

source: client_initial_method: method of the client that brings the result
pt_br: client_method: método do cliente que pega um registro de um resource

source: partial: means if you are going to update only part of your asset or you are going to update everything
pt_br: partial: significa se você deseja atualizar apenas parte de seu registro ou se deseja atualizar tudo

source: client_method: method of the client that to remove the resource
pt_br: client_method: método do cliente que remove um registro de um resource
