Repository: rhenter/django-api-client
Catalog: docs_src/source/locale/*/LC_MESSAGES/development/documentation.po
Languages: pt_br

source: Documentation
pt_br: Documentação

source: Update or Add New
pt_br: Atualizar ou Adicionar Nova

source: To add new or update documentation, you must add or change existing files in RST format, located at ``docs_src/source``
pt_br: Para adicionar nova ou atualizar a documentação, você deve adicionar ou alterar os arquivos existentes no formato RST, localizados em ``docs_src/source``

source: If you added a new file, make sure you add the reference in the directory ``docs_src/source/index.rst``
pt_br: Se você adicionou um novo arquivo, esteja certo de que você adicionou a referência no diretório ``docs_src/source/index.rst``

source: Update the translation
pt_br: Atualizar a tradução

source: Today we have 2 translations, being ``en`` (english) and ``pt_BR`` Portuguese, if you want to add one more, just add the prefix of the language that will be generated or updated in located in ``docs_src/source/locale/``
pt_br: Hoje temos 2 traduções, sendo `` en`` (inglês) e `` pt_BR`` (português), se você quiser adicionar mais uma, basta adicionar o prefixo do idioma que será gerado ou atualizado, localizado em ``docs_src/source/locale/``

source: Generate the .po files to update
pt_br: Gere os arquivos .po para atualizar

source: Update the .po files in ``docs_src/source/locale/< LANGUAGE prefix >/LC_MESSAGES/``
pt_br: Atualizar os aquivos .po em ``docs_src/source/locale/< Prefixo da LANGUAGE >/LC_MESSAGES/``

source: Example:
pt_br: Exemplo:

source: The .mo file will be generated when you generate the HTML files
pt_br: O arquivo .mo irá ser gerado quando você gerar os aquivos HTML

source: Generating the documentation
pt_br: Gerando a documentação

source: The project uses GitHub Pages to host the documentation files, so all HTML files must be located in /doc
pt_br: O projeto usa o GitHub Pages para hospedar os arquivos de documentação, então, todos os arquivos HTML devem estar localizados em /doc
